{
  "</think>": 151668,
  "</tool_call>": 151658,
  "</tool_response>": 151666,
  "<Black_Bishop>": 151741,
  "<Black_King>": 151744,
  "<Black_Knight>": 151740,
  "<Black_Pawn>": 151739,
  "<Black_Queen>": 151743,
  "<Black_Rook>": 151742,
  "<White_Bishop>": 151735,
  "<White_King>": 151738,
  "<White_Knight>": 151734,
  "<White_Pawn>": 151733,
  "<White_Queen>": 151737,
  "<White_Rook>": 151736,
  "<a1>": 151669,
  "<a2>": 151677,
  "<a3>": 151685,
  "<a4>": 151693,
  "<a5>": 151701,
  "<a6>": 151709,
  "<a7>": 151717,
  "<a8>": 151725,
  "<b1>": 151670,
  "<b2>": 151678,
  "<b3>": 151686,
  "<b4>": 151694,
  "<b5>": 151702,
  "<b6>": 151710,
  "<b7>": 151718,
  "<b8>": 151726,
  "<blank>": 151745,
  "<c1>": 151671,
  "<c2>": 151679,
  "<c3>": 151687,
  "<c4>": 151695,
  "<c5>": 151703,
  "<c6>": 151711,
  "<c7>": 151719,
  "<c8>": 151727,
  "<d1>": 151672,
  "<d2>": 151680,
  "<d3>": 151688,
  "<d4>": 151696,
  "<d5>": 151704,
  "<d6>": 151712,
  "<d7>": 151720,
  "<d8>": 151728,
  "<e1>": 151673,
  "<e2>": 151681,
  "<e3>": 151689,
  "<e4>": 151697,
  "<e5>": 151705,
  "<e6>": 151713,
  "<e7>": 151721,
  "<e8>": 151729,
  "<f1>": 151674,
  "<f2>": 151682,
  "<f3>": 151690,
  "<f4>": 151698,
  "<f5>": 151706,
  "<f6>": 151714,
  "<f7>": 151722,
  "<f8>": 151730,
  "<g1>": 151675,
  "<g2>": 151683,
  "<g3>": 151691,
  "<g4>": 151699,
  "<g5>": 151707,
  "<g6>": 151715,
  "<g7>": 151723,
  "<g8>": 151731,
  "<h1>": 151676,
  "<h2>": 151684,
  "<h3>": 151692,
  "<h4>": 151700,
  "<h5>": 151708,
  "<h6>": 151716,
  "<h7>": 151724,
  "<h8>": 151732,
  "<think>": 151667,
  "<tool_call>": 151657,
  "<tool_response>": 151665,
  "<|box_end|>": 151649,
  "<|box_start|>": 151648,
  "<|endoftext|>": 151643,
  "<|file_sep|>": 151664,
  "<|fim_middle|>": 151660,
  "<|fim_pad|>": 151662,
  "<|fim_prefix|>": 151659,
  "<|fim_suffix|>": 151661,
  "<|im_end|>": 151645,
  "<|im_start|>": 151644,
  "<|image_pad|>": 151655,
  "<|object_ref_end|>": 151647,
  "<|object_ref_start|>": 151646,
  "<|quad_end|>": 151651,
  "<|quad_start|>": 151650,
  "<|repo_name|>": 151663,
  "<|video_pad|>": 151656,
  "<|vision_end|>": 151653,
  "<|vision_pad|>": 151654,
  "<|vision_start|>": 151652
}
